<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data shape="?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x.1">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="self.actor.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 750" offset="0" size="1536000" />
			<output>
				<port id="0" precision="FP32" names="self.actor.0.weight">
					<dim>512</dim>
					<dim>750</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>750</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.actor.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="512" offset="1536000" size="2048" />
			<output>
				<port id="0" precision="FP32" names="self.actor.0.bias">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="17,input0.1">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="aten::elu/Elu" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="18,input1.1">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self.actor.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="1538048" size="524288" />
			<output>
				<port id="0" precision="FP32" names="self.actor.2.weight">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="aten::linear/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.actor.2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="256" offset="2062336" size="1024" />
			<output>
				<port id="0" precision="FP32" names="self.actor.2.bias">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::linear/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="21,input2.1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="aten::elu/Elu_1" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="22,input3.1">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.actor.4.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="2063360" size="131072" />
			<output>
				<port id="0" precision="FP32" names="self.actor.4.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::linear/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="self.actor.4.bias" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="2194432" size="512" />
			<output>
				<port id="0" precision="FP32" names="self.actor.4.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="aten::linear/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="25,input4.1">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="aten::elu/Elu_2" type="Elu" version="opset1">
			<data alpha="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="26,input5.1">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="self.actor.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="20, 128" offset="2194944" size="10240" />
			<output>
				<port id="0" precision="FP32" names="self.actor.6.weight">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="aten::linear/MatMul_3" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.actor.6.bias" type="Const" version="opset1">
			<data element_type="f32" shape="20" offset="2205184" size="80" />
			<output>
				<port id="0" precision="FP32" names="self.actor.6.bias">
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="aten::linear/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Result_47" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.4.0-16579-c3152d32c9c-releases/2024/4" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
